[
  "Error 14: No sigue la consigna. Las funciones requeridas no tienen las firmas correctas ni implementan la funcionalidad esperada. La función `costo()` debería recibir `inventario_csv` y `venta_txt` como parámetros, pero está definida sin parámetros (`def costo():`). La función `hacer_pedido()` no existe. Además, hay malas prácticas: el parámetro `FILE` en `invent(FILE)` es sobrescrito inmediatamente con un valor fijo (línea 6), y hay variables que se limpian innecesariamente al final de la función (líneas 25-27).",
  "Error 4: No propaga la excepción cuando falta el archivo de inventario. Según la consigna, si el archivo de inventario no existe, la excepción debe propagarse. En cambio, el código captura `FileNotFoundError` y solo imprime un mensaje.",
  "Error 2: No maneja correctamente la ausencia de `venta.txt`. La función `costo()` debería retornar `0.0` cuando `venta.txt` no existe, pero la función `venta()` solo imprime un mensaje y no retorna ningún valor indicativo. Además, `costo()` no tiene lógica para manejar este caso.",
  "Error 5: La función `costo()` imprime el resultado (`print(recaudado)`) pero no retorna ningún valor. Debe retornar un `float`.",
  "Error 6: La función `venta()` escribe en un archivo CSV (`pedi.csv`) modificando el sistema de archivos, lo cual no está especificado en la consigna. La función no debería modificar archivos.",
  "Error 7: Cálculo incorrecto. La función `costo()` intenta usar variables que no están definidas en su ámbito (`pedidos`, `objetos`, `cants`, `precio`, `cantidad`). Estas variables son locales a `invent()` y `venta()` y no se retornan. Además, `recaudado` se usa sin inicializar, y hay un error de sintaxis (`floats` en lugar de `float`). La lógica para calcular el costo total no está implementada correctamente.",
  "Error 1: Falta de modularización y reutilización de lógica común. Las funciones `invent()` y `venta()` no retornan valores, por lo que no pueden ser reutilizadas. No hay funciones auxiliares compartidas entre `costo()` y `hacer_pedido()`. Además, `invent()` y `venta()` no retornan los datos procesados.",
  "Error 15: Errores de ejecución. Hay múltiples problemas que causarán errores en tiempo de ejecución: variables no definidas, uso de nombres incorrectos (`floats` en lugar de `float`, `peidido` en lugar de `pedido` en línea 47), y lógica incorrecta en el parsing (líneas 46 y 48 tienen la misma condición `contador % 2 == 0`).",
  "Otros: La función `hacer_pedido()` no está implementada. Esta función es requerida por la consigna y debe retornar una lista de productos a reponer."
]